package Java2;

public class Level4_Условные_конструкции_1_if {
    public static void main(String[] args) {
    int a = 15, b = 10;
    if(a > b) {              /** если допустим а = 15 будет больше чем b = 10, то будет выполняться условие в фигурных {} скобках */
        System.out.println("Да верно!"); /** или допустим условие: if(a == b) это означает если "а" равно "b" */
    }                                      /** if(a >= b) это означает если "а" больше или равно "b" */
}                                          /** if(a != b) это означает если "а" не равно "b" */
}