package Java2;

/** Например класс - это чертёж робота, а объект - это уже сам робот со значениями и данными;
 * Наследование - это добавление полезных опций к чертежу робота (например добавить лазер в класс - Наследники), функционал которого взят из родительского класса;
 * Полиморфизм - это общий функционал для всех роботов, и его можно переписать для определённой модели робота, например в главном классе мы указали способ передвижения робота, а в классе "Наследники" - указали способ левитации, и в другом классе указали способ - плавать, то есть имеется общий функционал, но его можно дополнять и переписывать;
 * Инкапсуляция - это броня, защищающая робота, то есть свободного доступа к коду не будет, и можно будет получить доступ только по спец. методу (то есть по модификатору доступа: Protected или Prived).
 * 
*/


public class Level9_ООП { 
                               
    public static void main(String[] args) { /** public static void main(String[] args) - это один метод (функция) например у нас есть программа, в которой нам нужно регулярно пользоваться кодами, и здесь нам пригодятся "Функции", чтобы не пришлось повторять снова код */
      
    }                                      
}




